################################
######### HOMEBREW TAPS ########
################################

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# command-line tool for upgrading outdated cask apps https://github.com/buo/homebrew-cask-upgrade
tap "buo/cask-upgrade"
tap "dracula/install"
tap "aws/tap"
tap "hashicorp/tap"

################################
######### HOMEBREW TAPS ########
################################

# Alternative to `cat`: https://github.com/sharkdp/bat
brew "bat"
# Install GNU core utilities (those that come with macOS are outdated)
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew "coreutils"
brew "dos2unix"
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew "findutils"
brew "fzf"
brew "readline" # ensure gawk gets good readline
brew "gawk"
brew "gnutls"
brew "gnupg"
# Install some other useful utilities like `sponge`
brew "moreutils"
brew "tree"
brew "watch"
# Install wget with IRI support
brew "wget"
# https://github.com/jkbrzt/httpie
brew "httpie"
brew "jq"
brew "gh"
brew "git"
brew "htop"
brew "pre-commit"
brew "graphviz"
# Mac App Store CLI: https://github.com/mas-cli/mas
brew "mas"
brew "nvm"

brew "go"
brew "golang-migrate"
brew "golangci-lint"
brew "python"
brew "openjdk"
brew "lcov"

brew "awscli"
brew "aws-cdk"
brew "aws/tap/aws-sam-cli"
brew "awslogs"
brew "hashicorp/tap/terraform"

################################
######### HOMEBREW CASK ########
################################

cask "google-chrome"
cask "google-drive"
cask "sizeup"
cask "numi"
cask "itsycal"
cask "the-unarchiver"
cask "vlc"
cask "iterm2"
cask "visual-studio-code"
cask "sublime-text"
cask "wpsoffice"
cask "whatsapp"
cask "spotify"
cask "discord"
cask "dracula-terminal" # Dracula theme for Terminal.app

cask "appcleaner"
cask "zoom"
cask "anki"
cask "adobe-acrobat-reader"
cask "cleanmymac"

cask "docker" # Docker for mac
cask "insomnia"
cask "cyberduck"
cask "dbeaver-community"
cask "slack"


################################
####### MAC APPSTORE APPS ######
################################

mas "Xcode", id: 497799835
mas "WireGuard", id: 1451685025
